# SetTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..SetTypeId Method
DirectShape Class See Also
---
Sets the DirectShapeType for the DirectShape element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetTypeId(
	ElementId typeId
)
```

Visual Basic
---
```text
Public Sub SetTypeId ( _
	typeId As ElementId _
)
```

Visual C++
---
```text
public:
void SetTypeId(
	ElementId^ typeId
)
```

# ### Parameters
typeId
    Type: Autodesk.Revit.DB..::..ElementId The ID of the type corresponding to this DirectShape element. May only be set once.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | typeId is not a valid Element identifier. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace